Tekla.Structures.Catalogs.Parser
Class to parse the inp file containing the rebars

Tekla.Structures.Catalogs.Parser.RebarItemPropertyNames
The rebar item property names.

Tekla.Structures.Catalogs.Parser.Parse(System.String,Tekla.Structures.CatalogInternal.RebarItemEnumerator_t@)
Parses specified file to get rebars from the catalog file.
FilePath:  File to parse.
RebarList:  RebarItemEnumerator_t.

Tekla.Structures.Catalogs.Parser.Parse(System.String,Tekla.Structures.CatalogInternal.MeshItemEnumerator_t@)
Parses specified file to get meshes from the catalog file.
FilePath:  File to parse.
MeshList:  MeshItemEnumerator_t.

Tekla.Structures.Catalogs.Parser.GetCatalogPath(System.String)
Gets the path for a certain catalog file.
FileName: File name for the catalog to find
Returns: The paths where the catalog file is located.

Tekla.Structures.Catalogs.Parser.CheckIfHeaderLineAndTrimTags(System.String@)
Determines whether the line is a header line.
line: The line.
Returns: The line type if the line is a header line; otherwise null.

Tekla.Structures.Catalogs.Parser.LineToArrayOfStrings(System.String,System.Collections.Generic.List{System.String}@)
Splits a string using space as a separator. Everything between quotes
is considered to be a one string.
Line: The line to split.
Parameters: The list of obtained substrings.

Tekla.Structures.Catalogs.Parser.GetRebarItemFromLine(System.String)
Returns the Rebar item from the given line.
Line: Line from rebar db file
Returns: RebarItem.